# ▼▲▼ XRXS 9拡張CO-X. ふきだし自動設定 ▼▲▼
# by 桜雅 在土

#==============================================================================
# ■ Window_Message
#==============================================================================
class Window_Message < Window_Selectable
  #--------------------------------------------------------------------------
  # ○ ポップキャラクターの設定
  #--------------------------------------------------------------------------
  def pop_character=(character_id)
    @pop_character = character_id
    $mes_id = character_id
  end
end

