# ▽△▽ XRXS. RPGグラフィック機構 ▽△▽ built 221114
# by 桜雅 在土

#==============================================================================
# □ RPG_FileTest
#------------------------------------------------------------------------------
# 　RGSS暗号化にも対応したファイルチェックのモジュールです。
#==============================================================================
module RPG_FileTest
  #--------------------------------------------------------------------------
  # ○ キャラクターファイルの有無
  #--------------------------------------------------------------------------
  def RPG_FileTest.character_exist?(filename)
    return RPG::Cache.character(filename, 0) rescue return false
  end
  #--------------------------------------------------------------------------
  # ○ ピクチャーファイルの有無
  #--------------------------------------------------------------------------
  def RPG_FileTest.picture_exist?(filename)
    return RPG::Cache.picture(filename) rescue return false
  end
  #--------------------------------------------------------------------------
  # ○ バトラーグラフィックの有無
  #--------------------------------------------------------------------------
  def RPG_FileTest.battler_exist?(filename)
    return RPG::Cache.battler(filename, 0) rescue return false
  end
end

